0xkelvin/Ambiq-SDK/AmbiqSuite_SDK5.0.1/boards/apollo510_evb/examples/peripherals/uart_stream_echo_rxDma/src/uart_stream_common.c
//*****************************************************************************
//
//! @file uart_stream_common.c
//!
//! @brief Common code and definitions for uart_stream example
//!
//! @addtogroup uart_stream_echo_rx_dma
//! @{
//! @defgroup uart_stream_common_rx_dma_c UART Streaming Common Data
//! @{
//
//*****************************************************************************
//*****************************************************************************
//
// Copyright (c) 2025, Ambiq Micro, Inc.
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// 1. Redistributions of source code must retain the above copyright notice,
// this list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright
// notice, this list of conditions and the following disclaimer in the
// documentation and/or other materials provided with the distribution.
//
// 3. Neither the name of the copyright holder nor the names of its
// contributors may be used to endorse or promote products derived from this
// software without specific prior written permission.
//
// Third party software included in this distribution is subject to the
// additional license terms as defined in the /docs/licenses directory.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision release_sdk5p0p1-61912905f0 of the AmbiqSuite Development Package.
//
//*****************************************************************************
#include "uart_stream_common.h"
#include "am_util.h"

//
//! Uart pin definitions
//! This defaults with standard BSP pin definitions.
//
static const uart_hw_defs_t gs_UartPinDefs[eMAX_UARTS] =
{
#if UART0_AVAIL
    [eUART0] =
    {
    .uartId = eUART0,
    .rxPin = {AM_BSP_GPIO_COM_UART_RX, &g_AM_BSP_GPIO_COM_UART_RX},
    .txPin = {AM_BSP_GPIO_COM_UART_TX, &g_AM_BSP_GPIO_COM_UART_TX},
    .uartHwIndex = 0,

    },
#endif
#if UART1_AVAIL
    [eUART1] =
    {
        .uartId = eUART1,
        .rxPin = {AM_BSP_GPIO_UART1_RX, &g_AM_BSP_GPIO_UART1_RX},
        .txPin = {AM_BSP_GPIO_UART1_TX, &g_AM_BSP_GPIO_UART1_TX},
        .uartHwIndex = 1,
    },
#endif
#if UART2_AVAIL
    [eUART2] =
    {
        .uartId = eUART2,
        .rxPin = {AM_BSP_GPIO_UART2_RX, &g_AM_BSP_GPIO_UART2_RX},
        .txPin = {AM_BSP_GPIO_UART2_TX, &g_AM_BSP_GPIO_UART2_TX},
        .uartHwIndex = 2,
    },
#endif
#if UART3_AVAIL
    [eUART3] =
    {
        .uartId = eUART3,
        .rxPin = {AM_BSP_GPIO_UART3_RX, &g_AM_BSP_GPIO_UART3_RX},
        .txPin = {AM_BSP_GPIO_UART3_TX, &g_AM_BSP_GPIO_UART3_TX},
        .uartHwIndex = 3,
    },
#endif
};

//
//! uart error capture struct
//
typedef struct
{
    uint32_t loopCountErr;
    uint32_t posx;
    am_hal_uart_errors_t lastError;
}
error_cap_t;

//
//! this is to look at with debugger if printing is disabled
//
volatile error_cap_t ec;

//
//! decode standard error names for printing
//
static const char * const uartCmnErrStatus[] =
{
    "SUCCESS",
    "FAIL",
    "INVALID_HANDLE",
    "IN_USE",
    "TIMEOUT",
    "OUT_OF_RANGE",
    "INVALID_ARG",
    "INVALID_OPERATION",
    "MEM_ERR",
    "HW_ERR",
};

//
//! decode extended error names for printing
//
static const char * const uartDriverErrorStrings[] =
{
    "US_BUS_ERROR",
    "US_RX_QUEUE_FULL",
    "US_CLOCK_NOT_CONFIGURED",
    "US_BAUDRATE_NOT_POSSIBLE",
    "US_TX_CHANNEL_BUSY",
    "US_RX_CHANNEL_BUSY",
    "US_RX_TIMEOUT",
    "US_FRAME_ERROR",
    "US_PARITY_ERROR",
    "US_BREAK_ERROR",
    "US_OVERRUN_ERROR",
    "US_DMA_ERROR",
    "DMA_NO_INIT",
    "BUFFER_OVERFILL",
    "MEMORY_ERROR_01",
    "MEMORY_ERROR_02",
    "MEMORY_ERROR_03",
    "DMA_BUSY_ERROR",
    "RX_BUFF_TOO_SMALL",
    "DMA SETUP ERROR",
    "DMA INIT ERROR",
};

static const stream_error_message_action_map_t sStreamErrorMessageDefaultMap[] =
{
    {.bEnabled = false, .pfStreamAction = 0, .streamID = AM_HAL_UART_RX_DMA_COMPLETE, "uart_rx_dma_complete" },
    {.bEnabled = false, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_TX_BUSY           , "tx busy" },
    {.bEnabled = false, .pfStreamAction = 0, .streamID = AM_HAL_UART_RX_DMA_BUSY, "rx_dma_busy" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_TX_COMPLETE       , "tx_complete" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_RX_DMA_ERROR, "rx_dma_error" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_RX_DMA_TIMEOUT, "rx_dma_timeout" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_RX_DMA_OVERFLOW, "rx_dma_overflow" },

    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_RX_QUEUE_FULL,   "rx_queue_full" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_RX_DATA_AVAIL     , "rx_data_avail" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_TX_QUEUE_FULL     , "tx_queue_full" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_TX_DMA_BUSY       , "tx_dma_busy" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_TX_DMA_COMPLETE   , "tx_dma_complete" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_DMA_ERROR         , "dma_error" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_INTERNAL_DMA_ERROR, "intern_dma_error" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_FRM_ERROR, "framing_error" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_PRTY_ERROR, "parity_error" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_BRK_ERROR , "break_error" },
    {.bEnabled = true, .pfStreamAction = 0, .streamID = AM_HAL_UART_STREAM_STATUS_OVRN_ERROR, "overrun error" },
    {.bEnabled = false, .pfStreamAction = 0, .streamID = (am_hal_uart_stream_status_t)0, NULL },  // zero entry must be last
};

