0xkelvin/Ambiq-SDK/AmbiqSuite_SDK5.0.1/boards/apollo510_evb/examples/peripherals/uart_stream_echo_rxDma/src/uart_stream_common.c
static uart_examp_stream_vars_t *g_uartIsrMap[4];  //<! one for each uart
//
//! Place DMA ram in SRAM and align the region for better MPU access
//! The mpu will be used to disable the cache in this region
//
__attribute__ ((section ("SHARED_RW")))
__attribute__((aligned(32))) uart_dma_rx_tx_DMA_buffers_t g_dma_buff[NUM_UARTS_USED];

void am_uart_isr(void);
void am_uart1_isr(void);
void am_uart2_isr(void);
void am_uart3_isr(void);
static void am_isr_common(uart_examp_stream_vars_t *pUartDescriptor);


static uint32_t uart_cmn_buffAssignmentAssistant(
    am_hal_uart_stream_buff_t  *psDestBuffer,
    const am_hal_uart_stream_buff_t  *psSrcBuffer,
    uint32_t ui32MaxBufferSize,
    uint8_t *pui8DmaBuffer);

//*****************************************************************************
//
//! @brief Uart isr handlers
//! @note For example purposes capture all uart ISRs here and process them in the same way.
//
//*****************************************************************************
void am_uart_isr(void)
{
#if UART0_AVAIL
    am_isr_common(g_uartIsrMap[0]);
#endif
}

void am_uart1_isr(void)
{
#if UART1_AVAIL
    am_isr_common(g_uartIsrMap[1]);
#endif
}

void am_uart2_isr(void)
{
#if UART2_AVAIL
    am_isr_common(g_uartIsrMap[2]);
#endif
}

void am_uart3_isr(void)
{
#if UART3_AVAIL
    am_isr_common(g_uartIsrMap[3]);
#endif
}

//*****************************************************************************
//
//! @brief Common uart isr handler
//!
//! @param pUartDescriptor
//
//*****************************************************************************
static void am_isr_common(uart_examp_stream_vars_t *pUartDescriptor)
{
    pUartDescriptor->e32Status |= am_hal_uart_interrupt_stream_service(pUartDescriptor->pUartHandle);

    if (pUartDescriptor->e32Status != AM_HAL_UART_STREAM_STATUS_SUCCESS)
    {
        pUartDescriptor->ui32ISrErrorCount++;
    }
}

//*****************************************************************************
//
// called to configure MPU for dma data
//
//*****************************************************************************
uint32_t uart_stream_cmn_mpuConfig(void)
{
    uint32_t dmaBufAddr = (uint32_t) g_dma_buff;

    if ( dmaBufAddr >= AM_HAL_MRAM_SRAM_ADDR)
    {
        // want region set at non-cacheable if it is in SRAM
        // is data already non-cacheable if it's in DTCM?
        return mpuConfig( dmaBufAddr, sizeof(g_dma_buff) );
    }

    return AM_HAL_STATUS_SUCCESS;
}

//*****************************************************************************
//
// This will format an error string for either standard hal errors or uart
// specific errors
//
//*****************************************************************************
const char *printErrorString( am_hal_uart_errors_t eErrx, bool printError )
{
    const char *pcErrorInfoStr;
    if ((am_hal_status_e) eErrx <= AM_HAL_STATUS_HW_ERR )
    {
        pcErrorInfoStr = uartCmnErrStatus[eErrx];
    }
    else if ((eErrx >= (am_hal_uart_errors_t) AM_HAL_STATUS_MODULE_SPECIFIC_START) && (eErrx < AM_HAL_UART_ERR_END))
    {
        eErrx -= AM_HAL_STATUS_MODULE_SPECIFIC_START;
        pcErrorInfoStr = uartDriverErrorStrings[eErrx];
    }
    else
    {
        pcErrorInfoStr = "Unknown Error";
    }

    if ( printError )
    {
        am_util_stdio_printf("streaming call error status: %s\r\n", pcErrorInfoStr );
    }

    return pcErrorInfoStr;
}

//*****************************************************************************
//
//  will check and log run-time errors
//
//*****************************************************************************
void errorCheck(am_hal_uart_errors_t eErrx, uint32_t ui32LoopCount, uint32_t ui32ErrorPos)
{
    //
    // if there is an error, then print an error message and hang
    //
    if (eErrx)
    {
        //
        // Extract the error string
        //
        const char *pcErrorInfoStr = printErrorString(eErrx, false);

        ec.lastError    = eErrx;
        ec.loopCountErr = ui32LoopCount;
        ec.posx = ui32ErrorPos;
        am_util_stdio_printf("error capture: %s 0x%08x %d %d\r\n Exampling hanging\n", pcErrorInfoStr, eErrx, ui32LoopCount, ui32ErrorPos);
        while (1);
    }
}

//*****************************************************************************
//
//! @brief Initialize a UART instance
//!
//! @param uartId  the uart number (0<->(N-1))
//! @param pUartLocalVar ram allocated for this uart
//!
//! @return standard hal status
//
//*****************************************************************************
static uint32_t init_uart(uart_examp_stream_vars_t *psUartInfo,
                          am_hal_uart_stream_data_config_t *psDataFcg)
{
    //
    // get and check the uart number (not always identical  to the hardware instance in this example).
    //
    uart_id_e uartId = psUartInfo->uartId;

    if (uartId >= eMAX_UARTS)
    {
        return AM_HAL_STATUS_INVALID_ARG;
    }

    if ( psDataFcg->eStreamingDmaMode > AM_HAL_UART_DMA_RX_DOUBLE )
    {
        am_util_stdio_printf("invalid streaming mode: %d\r\n", psDataFcg->eStreamingDmaMode );
        return AM_HAL_STATUS_INVALID_OPERATION;
    }

    //
    // get the uart hardware instance
    // This will ensure the uart ID is mapped to the correct set of uart data
    //
    const uart_hw_defs_t *pUartDefs = psUartInfo->psUartPinDefs;
    g_uartIsrMap[pUartDefs->uartHwIndex] = psUartInfo;

    uint32_t uiStatus;
    do
    {
        //
        // setup rx and tx pins
        //
        uiStatus = am_hal_gpio_pinconfig(pUartDefs->txPin.pinNUmber, *(pUartDefs->txPin.pinCfg));
        if (uiStatus)
        {
            am_util_stdio_printf("tx ping config error: %d\r\n", uiStatus );
            break;
        }
        uiStatus = am_hal_gpio_pinconfig(pUartDefs->rxPin.pinNUmber, *(pUartDefs->rxPin.pinCfg));
        if (uiStatus)
        {
            am_util_stdio_printf("rx ping config error: %d\r\n", uiStatus );
            break;
        }

        am_util_stdio_printf("rx pin: %d, rx pin %d\r\n", pUartDefs->rxPin.pinNUmber, pUartDefs->txPin.pinNUmber);

        //
        // init the uart
        // first get the uart handle
        //
        uiStatus = am_hal_uart_stream_initialize(pUartDefs->uartHwIndex, &psUartInfo->pUartHandle);
        if (uiStatus)
        {
            am_util_stdio_printf("am_hal_uart_stream_initialize error: %d\r\n", uiStatus );
            break;
        }
        void *pUartHandle = psUartInfo->pUartHandle;

