0xkelvin/Ambiq-SDK/AmbiqSuite_SDK5.0.1/boards/apollo510_evb/examples/peripherals/uart_stream_echo_rxDma/src/uart_stream_common.c
        uiStatus = am_hal_uart_stream_power_control(pUartHandle, AM_HAL_SYSCTRL_WAKE, false);
        if (uiStatus)
        {
            am_util_stdio_printf("am_hal_uart_stream_power_control error: %d\r\n", uiStatus );
            break;
        }

        //! Config the low-level uart params (baud rate, stop bits)
        uiStatus = am_hal_uart_stream_configure( pUartHandle, psUartInfo->psUartConfig);
        if (uiStatus)
        {
            am_util_stdio_printf("am_hal_uart_stream_configure error: %d\r\n", uiStatus );
            break;
        }

        //
        // Configure the uart data
        //
        am_hal_uart_errors_t uiStreamStatus = am_hal_uart_stream_data_configure(pUartHandle, psDataFcg);
        if (uiStreamStatus)
        {
            const char *str = printErrorString(uiStreamStatus, false);
            am_util_stdio_printf("am_hal_uart_stream_data_configure error: %s %x\r\n", str, uiStreamStatus);
            uiStatus = (uint32_t) uiStreamStatus;
            break;
        }

        //
        // Make sure to enable the interrupts for RX, since the HAL doesn't already
        // know we intend to use them., this is done later in the startup sequence
        //
    }
    while( false );

    if (uiStatus == AM_HAL_STATUS_SUCCESS)
    {
        //
        // no errors above, enable the uart ISR, elevate the priority for high-speed testing
        //
        IRQn_Type eIrqType = (IRQn_Type) (pUartDefs->uartHwIndex + UART0_IRQn);

        NVIC_ClearPendingIRQ(eIrqType);
        //
        // raise the uart priority above normal
        //
        uint32_t ui32InterruptPriority = (AM_IRQ_PRIORITY_DEFAULT > 1)? (AM_IRQ_PRIORITY_DEFAULT-1) : AM_IRQ_PRIORITY_DEFAULT;
        NVIC_SetPriority(eIrqType, ui32InterruptPriority);
        NVIC_EnableIRQ(eIrqType);
    }

    return uiStatus;
}

//*****************************************************************************
//
//! @brief Computes buffer assignments based on inputs
//!
//! if source buffer isn't provided (null) the dma buffer is used
//!
//! @param psDestBuffer pointer to dest buffer struct
//! @param psSrcBuffer pointer to src buffer struct
//! @param ui32MaxBufferSize
//! @param pui8DmaBuffer  pointer to dma buffer
//!
//! @return  standard hal status (success)
//
//*****************************************************************************
static uint32_t uart_cmn_buffAssignmentAssistant(
    am_hal_uart_stream_buff_t  *psDestBuffer,
    const am_hal_uart_stream_buff_t  *psSrcBuffer,
    uint32_t ui32MaxBufferSize,
    uint8_t *pui8DmaBuffer)
{
    uint32_t ui32SourceBufferSize = psSrcBuffer->ui32BufferSize;
    psDestBuffer->ui32BufferSize = ui32SourceBufferSize;

    //
    // if the user supplied pointer is null, then the
    // SRAM buffer will be used (the region with cache disabled)
    //
    if (psSrcBuffer->pui8Buff)
    {
        psDestBuffer->pui8Buff = psSrcBuffer->pui8Buff;
    }
    else
    {
        psDestBuffer->pui8Buff = pui8DmaBuffer;
        if ((ui32SourceBufferSize == 0) || (ui32SourceBufferSize > ui32MaxBufferSize))
        {
            psDestBuffer->ui32BufferSize = ui32MaxBufferSize;
        }
    }

    return AM_HAL_STATUS_SUCCESS;
}

//*****************************************************************************
//
//! @brief Initialize the serial module and associated tx and tx pins
//!
//! @param pUartDesc  pointer to local struct that holds uart params
//! @param psRxStreamConfig pointer to const struct that defines rx params
//! @param sTxStreamConfig  pointer to const struct that defines tx params
//!
//! @return standard hal status
//
//*****************************************************************************
uint32_t
uart_cmn_serial_interface_init(uart_examp_stream_vars_t *pUartDesc,
                               const am_hal_uart_stream_rx_config_t *psRxStreamConfig,
                               const am_hal_uart_stream_tx_config_t *sTxStreamConfig )
{
    uint8_t uartHwInstance = pUartDesc->uart_hardware_instance;
    for (uart_id_e uartId = (uart_id_e) 0; uartId< eMAX_UARTS; uartId++)
    {
        if (gs_UartPinDefs[uartId].uartHwIndex == uartHwInstance)
        {
            pUartDesc->uartId = uartId;
        }
    }

    //
    // Start the UART that is enabled here
    // if fifo buffers aren't provided use the dma buffers
    //

    am_hal_uart_stream_data_config_t sDataCfg;

    // these are set in uart_stream_example_config.h
    sDataCfg.eStreamingDmaMode = STREAMING_DMA_MODE;

    sDataCfg.sRxStreamConfig = *psRxStreamConfig;
    sDataCfg.sTxStreamConfig = *sTxStreamConfig;

    uint32_t uartIndexOffset = 0;      // This is the only uart used, the index is zero, this is not the uart hardware number

    //
    // assign xx
    //
    uart_cmn_buffAssignmentAssistant( &sDataCfg.sRxStreamConfig.sRxBuffer,
        &psRxStreamConfig->sRxBuffer,
        RX_BUFFER_SIZE,
        g_dma_buff[uartIndexOffset].pui8UARTRXDMABuffer);

    uart_cmn_buffAssignmentAssistant( &sDataCfg.sTxStreamConfig.sTxBuffer,
        &sTxStreamConfig->sTxBuffer,
        TX_BUFFER_SIZE,
        g_dma_buff[uartIndexOffset].pui8UARTTXDMABuffer);


    if (pUartDesc->pfTimerCallback)
    {
        //
        // if the function is defined, the timed callback will be used
        //
        uint32_t ui32Status = uart_timer_init( &pUartDesc->sUartTimerParams, pUartDesc->pfTimerCallback);
        if ( ui32Status )
        {
            am_util_stdio_printf("%invalid periodic timer config %d\nThe program will hang\n", ui32Status);
            while(1);
        }
    }

    //
    // get and save the pointer to the uart pin defs for this uart
    //
    pUartDesc->psUartPinDefs = &gs_UartPinDefs[pUartDesc->uartId];

    uint32_t ui32status      = init_uart(pUartDesc, &sDataCfg);

    return ui32status;

} //serial_interface_init

//*****************************************************************************
//
// MPU config. Configure DMA region for as non-cacheable
//
//*****************************************************************************
uint32_t mpuConfig(uint32_t ui32BaseAddress, uint32_t ui32DmaSize)
{
    ARM_MPU_Disable();

    //
    // Randomly choose an MPU slot, sometimes 0,1 are used for other things
    //
    uint8_t ui32AttrIndex = 3;
    uint8_t ui32CachePolicy = (ARM_MPU_ATTR_NON_CACHEABLE << 4) | ARM_MPU_ATTR_NON_CACHEABLE;

    //
    // define mpu attributes for no cache
    //
    ARM_MPU_SetMemAttr(ui32AttrIndex, ui32CachePolicy);

