0xkelvin/Ambiq-SDK/AmbiqSuite_SDK5.0.1/boards/apollo510_evb/examples/peripherals/uart_stream_echo_rxDma/src/uart_stream_common.c
    uint32_t endAddr     = ui32BaseAddress + ui32DmaSize -1;

    //
    // define MPU region
    //
    am_hal_mpu_region_config_t mpuRegion =
    {
        .ui32RegionNumber = 3,             // 3 is a random choice, has nothing to do with ui32AttrIndex
        .ui32BaseAddress  = ui32BaseAddress,
        .eShareable = ARM_MPU_SH_INNER,
        .eAccessPermission = RW_NONPRIV,
        .bExecuteNever = true,
        .ui32LimitAddress = endAddr,
        .ui32AttrIndex = ui32AttrIndex,
        .bEnable = true,
    };

    uint32_t  ui32Status = am_hal_mpu_region_configure( &mpuRegion, 1 );
    if (ui32Status)
    {
        return ui32Status;
    }

    return am_hal_mpu_enable(true, true);
}

//*****************************************************************************
//
// enable standard interrupts for uart streaming modes
//
//*****************************************************************************
uint32_t serial_interrupt_enable( uart_examp_stream_vars_t *psStreamLVars )
{
    return am_hal_uart_stream_interrupt_clr_set(psStreamLVars->pUartHandle,
        0,  // clear
        (AM_HAL_UART_INT_RX | AM_HAL_UART_INT_RX_TMOUT)); // set
}
//*****************************************************************************
//
// enable standard interrupts for uart streaming modes
//
//*****************************************************************************
uint32_t mcu_setup(void)
{
    //
    // Configure the board for low power operation.
    //
    am_bsp_low_power_init();

    //
    // Enable the ITM print interface.
    //
    uint32_t ui32Status =  (uint32_t) am_bsp_itm_printf_enable();
    if (ui32Status)
    {
        return ui32Status;
    }

#ifndef AM_PART_APOLLO330P_510L
    //
    // Enable HFADJ
    //
    ui32Status = am_hal_clkgen_control(AM_HAL_CLKGEN_CONTROL_HFADJ_ENABLE, 0);
    if (ui32Status)
    {
        am_util_stdio_printf(" am_hal_clkgen_control error: %d\n", ui32Status);
        return ui32Status;
    }

    //
    // Enable SYSPLL.
    //
    ui32Status = am_hal_clkmgr_clock_config(AM_HAL_CLKMGR_CLK_ID_SYSPLL, AM_HAL_UART_PLLCLK_FREQ, NULL);
    if (ui32Status)
    {
        am_util_stdio_printf(" am_hal_clkmgr_clock_config error: %d\n", ui32Status);
    }


#else

    //
    // Set XTAL_HS as highest priority for SYSPLL FREF.
    //
    am_hal_clkmgr_syspll_fref_priority_t sSysPllFrefPrio =
    {
        .high = AM_HAL_SYSPLL_FREFSEL_XTAL48MHz,
        .mid = AM_HAL_SYSPLL_FREFSEL_EXTREFCLK,
        .low = AM_HAL_SYSPLL_FREFSEL_HFRC192DIV4,
    };
    am_hal_clkmgr_control(AM_HAL_CLKMGR_SYPLL_FREF_PRIORITY_SET, (void*)&sSysPllFrefPrio);

    //
    am_hal_clkmgr_clock_config(AM_HAL_CLKMGR_CLK_ID_PLLVCO, 0, NULL);
    ui32Status = am_hal_clkmgr_clock_config(AM_HAL_CLKMGR_CLK_ID_PLLPOSTDIV, AM_HAL_UART_PLLCLK_FREQ, NULL);
    if (ui32Status != AM_HAL_STATUS_SUCCESS)
    {
        am_util_stdio_printf(" PLLPOSTDIV clock source error: %d\n", ui32Status);
    }
#endif  // AM_PART_APOLLO330P_510L

    return ui32Status;
}
//*****************************************************************************
//
//! @brief utility function that'll print error and status messages from the stream isr service
//!
//! @param psAsyncLVars  pointer to stream variables
//! @param streamStatus  the isr return status
//!
//! @return accumulated status from any function calls, non-zero is an error
//
//*****************************************************************************
uint32_t processStreamErrorDefMap(uart_examp_stream_vars_t *psAsyncLVars,
                                  am_hal_uart_stream_status_t streamStatus)
{
    return processStreamError( sStreamErrorMessageDefaultMap, psAsyncLVars, streamStatus);
} // processStreamErrorDefMap


//*****************************************************************************
//
//! @brief utility function that'll print error and status messages from the stream isr service
//!
//! @param pSEM          uses an external status action map
//! @param psAsyncLVars  pointer to stream variables
//! @param streamStatus  the isr return status
//!
//! @return accumulated status from any function calls, non-zero is an error
//
//*****************************************************************************
uint32_t processStreamError(const stream_error_message_action_map_t *pSEM,
                            uart_examp_stream_vars_t *psAsyncLVars,
                            am_hal_uart_stream_status_t streamStatus)
{
    uint32_t status = 0;
    //
    // loop through all the bits that can be set in the return from the ISR
    // if any are set, print a message or take action
    //
    while ( streamStatus && pSEM->streamID )
    {
        //
        // there is at least one-bit set
        //
        if (pSEM->bEnabled && (streamStatus & pSEM->streamID))
        {
            //
            // processing is enabled for this bit, and
            // the bit was set in the isr return
            //
            if (pSEM->pfStreamAction)
            {
                //
                // A function has been defined to process the output
                //
                status |= pSEM->pfStreamAction(psAsyncLVars);
            }
            else
            {
                //
                // print the associated message
                //
                const char *msg = pSEM->stream_message;
                am_util_stdio_printf( "uart %d: %s\r\n", psAsyncLVars->uartId, msg );
            }
        } // enabled

        //
        //! clear this bit, this allows early termination of the loop
        //
        streamStatus &= ~pSEM->streamID;

        //
        // advance to the next candidate bit
        //
        pSEM++;
    } // while

    return status;
} // processStreamError

//*****************************************************************************
//
// End Doxygen group.
//! @}
//! @}
//
//*****************************************************************************
